Revit 2024 API
ReleaseType Enumeration
 The release type.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Since: 2016
Syntax
C#
public enum ReleaseType
Visual Basic
Public Enumeration ReleaseType
Visual C++
public enum class ReleaseType
Members
Member name | Description
Fixed |  Fixed.
Pinned |  Pinned.
BendingMoment |  Bending Moment.
UserDefined |  User Defined.
See Also
Autodesk.Revit.DB.Structure Namespace